---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailIndex.RightSecondary
enum: Autodesk.Revit.DB.Architecture.RailIndex
source: html/c743a6e2-aedc-7320-55b2-bbc8624ec606.htm
---
# Autodesk.Revit.DB.Architecture.RailIndex.RightSecondary

The rail is a secondary rail on the right.